# Библиотека Pandas

## Data Frame

In [15]:
import pandas as pd

In [17]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('C:\AnacondaSrc\LearningProject\CourseExample\data_sample_example.tsv', header=0, sep='\t')

In [18]:
frame

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Birth</th>
      <th>City</th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Иванов А.А.</td>
      <td>22.03.1980</td>
      <td>Москва</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Сорокин И.В.</td>
      <td>07.08.1965</td>
      <td>Волгоград</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Белов М.М.</td>
      <td>13.02.1980</td>
      <td>Ростов</td>
      <td>менеджер</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
      <td>15.04.1985</td>
      <td>Ростов</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Рыбина Е.П.</td>
      <td>19.11.1985</td>
      <td>Москва</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Костров С.О.</td>
      <td>31.05.1985</td>
      <td>Москва</td>
      <td>стажер</td>
    </tr>
  </tbody>
</table>
</div>

In [19]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [20]:
#изменение типа столбца с помощью функции apply
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [37]:
frame

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Birth</th>
      <th>City</th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Иванов А.А.</td>
      <td>1980-03-22</td>
      <td>Москва</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Сорокин И.В.</td>
      <td>1965-07-08</td>
      <td>Волгоград</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Белов М.М.</td>
      <td>1980-02-13</td>
      <td>Ростов</td>
      <td>менеджер</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
      <td>1985-04-15</td>
      <td>Ростов</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Рыбина Е.П.</td>
      <td>1985-11-19</td>
      <td>Москва</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Костров С.О.</td>
      <td>1985-05-31</td>
      <td>Москва</td>
      <td>стажер</td>
    </tr>
  </tbody>
</table>
</div>

In [22]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [23]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [38]:
#заполнение пропущенных значений с помощью метода fillna
frame[[0]]

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Иванов А.А.</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Сорокин И.В.</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Белов М.М.</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Рыбина Е.П.</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Костров С.О.</td>
    </tr>
  </tbody>
</table>
</div>

In [36]:
frame.drop(0, axis=1, inplace=True)

In [28]:
frame.Position

0         NaN
1     инженер
2    менеджер
3         NaN
4     инженер
5      стажер
Name: Position, dtype: object

In [39]:
frame[['Position']]

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>инженер</td>
    </tr>
    <tr>
      <th>2</th>
      <td>менеджер</td>
    </tr>
    <tr>
      <th>3</th>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>инженер</td>
    </tr>
    <tr>
      <th>5</th>
      <td>стажер</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:
frame[['Name', 'Position']]

In [ ]:
frame[:3] #выбираем первые три записи

In [ ]:
frame[-3:] #выбираем три послдение записи

In [ ]:
frame.loc[[0,1,2], ["Name", "City"]] #работает на основе имен

In [ ]:
frame.iloc[[1,3,5], [0,1]] #работает на основе позиций

In [ ]:
frame.ix[[0,1,2], ["Name", "City"]]  #поддерживает и имена и позиции (пример с именами)

In [ ]:
frame.ix[[0,1,2], [0,1]] #поддерживает и имена и позиции (пример с позициями)

In [40]:
#выбираем строки, которые удовлетворяют условию frame.Birth >= pd.datetime(1985,1,1)
frame[frame.Birth >= pd.datetime(1985,1,1)]

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Birth</th>
      <th>City</th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
      <td>1985-04-15</td>
      <td>Ростов</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Рыбина Е.П.</td>
      <td>1985-11-19</td>
      <td>Москва</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Костров С.О.</td>
      <td>1985-05-31</td>
      <td>Москва</td>
      <td>стажер</td>
    </tr>
  </tbody>
</table>
</div>

In [43]:
#выбираем строки, удовлетворяющие пересечению условий
frame[(frame.Birth >= pd.datetime(1985,1,1)) &
      (frame.City != 'Москва')]

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Birth</th>
      <th>City</th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
      <td>1985-04-15</td>
      <td>Ростов</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [54]:
#выбираем строки, удовлетворяющие объединению условий
frame[(frame.Birth >= pd.datetime(1985,1,1)) |
      (frame.City == 'Волгоград')].fillna('www')

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Birth</th>
      <th>City</th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1</th>
      <td>Сорокин И.В.</td>
      <td>1965-07-08</td>
      <td>Волгоград</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
      <td>1985-04-15</td>
      <td>Ростов</td>
      <td>www</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Рыбина Е.П.</td>
      <td>1985-11-19</td>
      <td>Москва</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Костров С.О.</td>
      <td>1985-05-31</td>
      <td>Москва</td>
      <td>стажер</td>
    </tr>
  </tbody>
</table>
</div>

In [55]:
frame

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Birth</th>
      <th>City</th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Иванов А.А.</td>
      <td>1980-03-22</td>
      <td>Москва</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Сорокин И.В.</td>
      <td>1965-07-08</td>
      <td>Волгоград</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Белов М.М.</td>
      <td>1980-02-13</td>
      <td>Ростов</td>
      <td>менеджер</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
      <td>1985-04-15</td>
      <td>Ростов</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Рыбина Е.П.</td>
      <td>1985-11-19</td>
      <td>Москва</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Костров С.О.</td>
      <td>1985-05-31</td>
      <td>Москва</td>
      <td>стажер</td>
    </tr>
  </tbody>
</table>
</div>

In [56]:
t = frame

In [59]:
t[(t.Birth >= pd.datetime(1985,1,1)) |
      (t.City == 'Волгоград')] = t[(t.Birth >= pd.datetime(1985,1,1)) |
      (t.City == 'Волгоград')].fillna('wer')

In [60]:
t

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Birth</th>
      <th>City</th>
      <th>Position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Иванов А.А.</td>
      <td>1980-03-22</td>
      <td>Москва</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Сорокин И.В.</td>
      <td>1965-07-08</td>
      <td>Волгоград</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Белов М.М.</td>
      <td>1980-02-13</td>
      <td>Ростов</td>
      <td>менеджер</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Мельникова Д.С.</td>
      <td>1985-04-15</td>
      <td>Ростов</td>
      <td>wer</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Рыбина Е.П.</td>
      <td>1985-11-19</td>
      <td>Москва</td>
      <td>инженер</td>
    </tr>
    <tr>
      <th>5</th>
      <td>Костров С.О.</td>
      <td>1985-05-31</td>
      <td>Москва</td>
      <td>стажер</td>
    </tr>
  </tbody>
</table>
</div>